pepe2k/CC3000-SDK/CC3000 SDK/LM4F232H5QD/Basic WiFi Application/Basic WiFi Source/Source/CC3000 Spi/spi.c

/*****************************************************************************
*
*  spi.c - CC3000 Host Driver Implementation.
*  Copyright (C) 2011 Texas Instruments Incorporated - http://www.ti.com/
*
*  Redistribution and use in source and binary forms, with or without
*  modification, are permitted provided that the following conditions
*  are met:
*
*    Redistributions of source code must retain the above copyright
*    notice, this list of conditions and the following disclaimer.
*
*    Redistributions in binary form must reproduce the above copyright
*    notice, this list of conditions and the following disclaimer in the
*    documentation and/or other materials provided with the   
*    distribution.
*
*    Neither the name of Texas Instruments Incorporated nor the names of
*    its contributors may be used to endorse or promote products derived
*    from this software without specific prior written permission.
*
*  THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS 
*  "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT 
*  LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
*  A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT 
*  OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, 
*  SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT 
*  LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
*  DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
*  THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT 
*  (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE 
*  OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
*
*****************************************************************************/

//*****************************************************************************
//
//! \addtogroup link_buff_api
//! @{
//
//*****************************************************************************


#include "hci.h"
#include "spi.h"


#include "inc/hw_types.h"
#include "driverlib/rom.h"
#include "driverlib/rom_map.h"
#include "driverlib/gpio.h"
#include "driverlib/interrupt.h"
#include "driverlib/rom.h"
#include "driverlib/sysctl.h"
#include "driverlib/udma.h"
#include "driverlib/uart.h"
#include "driverlib/ssi.h"
#include "inc/hw_ints.h"
#include "inc/hw_nvic.h"
#include "inc/hw_memmap.h"
#include "inc/hw_types.h"
#include "inc/hw_ssi.h"
#include "inc/hw_uart.h"

#include "spi_version.h"


#define SPI_BASE 					SSI3_BASE
#define SPI_CLK_PIN              	GPIO_PIN_0
#define SPI_RX_PIN               	GPIO_PIN_2
#define SPI_TX_PIN               	GPIO_PIN_3

#define INT_SPI						INT_SSI3

#define SYSCTL_PERIPH_SPI			SYSCTL_PERIPH_SSI3

#define SPI_CLK_MUX_SEL				GPIO_PH0_SSI3CLK
#define SPI_RX_MUX_SEL				GPIO_PH2_SSI3RX
#define SPI_TX_MUX_SEL				GPIO_PH3_SSI3TX

#define SPI_UDMA_RX_CHANNEL 		 UDMA_CH14_SSI3RX
#define SPI_UDMA_TX_CHANNEL			 UDMA_CH15_SSI3TX

#define FWT_DELAY               4000
#define DMA_WINDOW_SIZE         1024

#define SPI_WINDOW_SIZE         DMA_WINDOW_SIZE
#define DMA_CHANNEL_CONTROL_STRUCTURE_SIZE	(512)
#define READ                    3
#define WRITE                   1

#define HI(value)               (((value) & 0xFF00) >> 8)
#define LO(value)               ((value) & 0x00FF)

#define ASSERT_CS()          (MAP_GPIOPinWrite(sSpiInformation.sHwSettings.ulPioSpiPort, sSpiInformation.sHwSettings.ulPioSpiCs, 0))

#define DEASSERT_CS()        (MAP_GPIOPinWrite(sSpiInformation.sHwSettings.ulPioSpiPort, sSpiInformation.sHwSettings.ulPioSpiCs, sSpiInformation.sHwSettings.ulPioSpiCs))


#define HEADERS_SIZE_EVNT       (SPI_HEADER_SIZE + 5)

#define SPI_HEADER_SIZE			(5)

#define 	eSPI_STATE_POWERUP 				 (0)
#define 	eSPI_STATE_INITIALIZED  		 (1)
#define 	eSPI_STATE_IDLE					 (2)
#define 	eSPI_STATE_WRITE_IRQ	   		 (3)
#define 	eSPI_STATE_WRITE_FIRST_PORTION   (4)
#define 	eSPI_STATE_WRITE_EOT			 (5)
#define 	eSPI_STATE_READ_IRQ				 (6)
#define 	eSPI_STATE_READ_FIRST_PORTION	 (7)
#define 	eSPI_STATE_READ_EOT				 (8)



typedef struct
{
	unsigned long ulPioPortAddress;
	unsigned long ulPioSpiPort;
	unsigned long ulPioSpiCs;
	unsigned long ulPortInt;
	unsigned long ulPioSlEnable;
	
	unsigned long uluDmaPort;
	unsigned long uluDmaRxChannel;
	unsigned long uluDmaTxChannel;
	
	unsigned long ulSsiPort;
	unsigned long ulSsiPortAddress;
	unsigned long ulSsiTx;
	unsigned long ulSsiRx;
	unsigned long ulSsiClck;
	unsigned long ulSsiPortInt;
}tSpiHwConfiguration;

typedef struct
{
	gcSpiHandleRx  SPIRxHandler;

	unsigned short usTxPacketLength;
	unsigned short usRxPacketLength;
	volatile unsigned long  ulSpiState;
	unsigned char *pTxPacket;
	unsigned char *pRxPacket;
	tSpiHwConfiguration	sHwSettings;
}tSpiInformation;


tSpiInformation sSpiInformation;


// The magic number that resides at the end of the TX/RX buffer (1 byte after 
// the allocated size) for the purpose of detection of the overrun. The location
// of the memory where the magic number  resides shall never be written. 
// In case it is written - the overrun occurred and either receive function or
// send function will stuck forever.

#define CC3000_BUFFER_MAGIC_NUMBER (0xDE)

///////////////////////////////////////////////////////////////////////////////////////////////////////////
//#pragma is used for determine the memory location for a specific variable.                            ///        
//__no_init is used to prevent the buffer initialization in order to prevent hardware WDT expiration    ///
// before entering to 'main()'.                                                                         ///
//for every IDE, different syntax exists :          1.   __CCS__ for CCS v5                             ///
//                                                  2.  __IAR_SYSTEMS_ICC__ for IAR Embedded Workbench  ///
// *CCS does not initialize variables - therefore, __no_init is not needed.                             ///
///////////////////////////////////////////////////////////////////////////////////////////////////////////

#ifdef __CCS__
unsigned char wlan_rx_buffer[CC3000_RX_BUFFER_SIZE];
unsigned char wlan_tx_buffer[CC3000_TX_BUFFER_SIZE];
unsigned char chBuffer[CC3000_RX_BUFFER_SIZE];
#pragma DATA_ALIGN(ucDMAChannelControlStructure, 1024); 
static unsigned char ucDMAChannelControlStructure[DMA_CHANNEL_CONTROL_STRUCTURE_SIZE];
#elif __IAR_SYSTEMS_ICC__
__no_init unsigned char wlan_rx_buffer[CC3000_RX_BUFFER_SIZE];
__no_init unsigned char wlan_tx_buffer[CC3000_TX_BUFFER_SIZE];
__no_init unsigned char chBuffer[CC3000_RX_BUFFER_SIZE];
#pragma data_alignment=1024
__no_init static unsigned char ucDMAChannelControlStructure[DMA_CHANNEL_CONTROL_STRUCTURE_SIZE];
#endif


// Static buffer for 5 bytes of SPI HEADER
unsigned char tSpiReadHeader[] = {READ, 0, 0, 0, 0};

void SpiWriteDataSynchronous(const unsigned char *data, unsigned short size);
void SpiWriteAsync(const unsigned char *data, unsigned short size);
void SpiReadData(unsigned char *data, unsigned short size);
void SpiDisableInterrupts(void);
void SpiResumeSpi(void);


//*****************************************************************************
//  
//!  SpiSysDelay
//! 
//!  @param  ulTicks ticks
//! 
//!  @return none
//! 
//!  @brief  This function delay for a few sys ticks.
//!          
// 
//*****************************************************************************

void
SpiSysDelay(unsigned long ulTicks)
{
	SysCtlDelay(ulTicks);
}

//*****************************************************************************
// 
//!  SpiConfigureHwMapping
//! 
//!  @param  none
//! 
//!  @return none
//! 
//!  @brief  This function get the reason for the GPIO interrupt
//!          and clear corresponding interrupt flag
// 
//*****************************************************************************
void 
SpiConfigureHwMapping(void)
{
	sSpiInformation.sHwSettings.ulPioPortAddress = SYSCTL_PERIPH_SPI_PORT;
	sSpiInformation.sHwSettings.ulPioSpiCs   = SPI_CS_PIN;
	sSpiInformation.sHwSettings.ulPioSpiPort = SPI_PORT;	
	sSpiInformation.sHwSettings.uluDmaPort   = SYSCTL_PERIPH_UDMA;
	sSpiInformation.sHwSettings.ulPortInt	 = INT_GPIO_SPI;
	sSpiInformation.sHwSettings.ulSsiPortAddress = SYSCTL_PERIPH_SPI;
	sSpiInformation.sHwSettings.ulSsiTx = SPI_TX_PIN;
	sSpiInformation.sHwSettings.ulSsiRx = SPI_RX_PIN;	
	sSpiInformation.sHwSettings.ulSsiClck = SPI_CLK_PIN;
	sSpiInformation.sHwSettings.ulSsiPort = SPI_BASE;
	sSpiInformation.sHwSettings.ulSsiPortInt = INT_SPI;	
	sSpiInformation.sHwSettings.uluDmaRxChannel = SPI_UDMA_RX_CHANNEL;
	sSpiInformation.sHwSettings.uluDmaTxChannel = SPI_UDMA_TX_CHANNEL;
}

//*****************************************************************************
// 
//!  SpiCleanGPIOISR
//! 
//!  @param  none
//! 
//!  @return none
//! 
//!  @brief  This function get the reason for the GPIO interrupt
//!          and clear corresponding interrupt flag
// 
//*****************************************************************************
void
SpiCleanGPIOISR(void)
{
	unsigned long    ulStatus;
	
	// Get the reason for the interrupt
	ulStatus = MAP_GPIOPinIntStatus(SPI_GPIO_IRQ_BASE, true);
	
