pepe2k/CC3000-SDK/CC3000 SDK/LM4F232H5QD/Basic WiFi Application/Basic WiFi Source/Source/CC3000 Spi/spi.c
	// Clear the asserted interrupts
	MAP_GPIOPinIntClear(SPI_GPIO_IRQ_BASE, ulStatus);	
}

//*****************************************************************************
//
//!  SSIConfigure
//!
//!  @param  ulSSIFreq
//!  @param  bForceGpioConfiguration
//!  @param  ulSysClck
//!
//!  @return none
//!
//!  @brief  Configure the SSI
//
//*****************************************************************************
void
SSIConfigure(unsigned long ulSSIFreq, unsigned long bForceGpioConfiguration, unsigned long ulSysClck)
{
	
	MAP_SysCtlPeripheralEnable(sSpiInformation.sHwSettings.ulPioPortAddress);	
	MAP_SysCtlPeripheralEnable(sSpiInformation.sHwSettings.ulSsiPortAddress);		
	GPIOPinConfigure(SPI_CLK_MUX_SEL);
	GPIOPinConfigure(SPI_RX_MUX_SEL);
	GPIOPinConfigure(SPI_TX_MUX_SEL); 
	
	// Configure the appropriate pins to be SSI0 instead of GPIO
	MAP_GPIOPinTypeSSI(sSpiInformation.sHwSettings.ulPioSpiPort, sSpiInformation.sHwSettings.ulSsiTx | sSpiInformation.sHwSettings.ulSsiRx | sSpiInformation.sHwSettings.ulSsiClck);
	
	MAP_GPIOPadConfigSet(sSpiInformation.sHwSettings.ulPioSpiPort, sSpiInformation.sHwSettings.ulSsiClck, GPIO_STRENGTH_8MA,
											 GPIO_PIN_TYPE_STD_WPD);
	
	// Configure and enable the SSI port for master mode
	MAP_SysCtlPeripheralReset(sSpiInformation.sHwSettings.ulSsiPortAddress);
	
	// Ensure that the SSE bit in the SSICR1 register is clear before making any configuration changes
	MAP_SSIDisable(sSpiInformation.sHwSettings.ulSsiPort);
	
	// 16MHz SSI with bit 8 bits data (DSS); Polarity '0' Phase '1'
	MAP_SSIConfigSetExpClk(sSpiInformation.sHwSettings.ulSsiPort, ulSysClck, SSI_FRF_MOTO_MODE_1,
												 SSI_MODE_MASTER, ulSSIFreq, 8);
	
	// Enable EOT mode for the SSI0RIS EOT bit
	HWREG(sSpiInformation.sHwSettings.ulSsiPort + SSI_O_CR1) |= SSI_CR1_EOT;
	
	// Enable the SSI by setting the SSE
	MAP_SSIEnable(sSpiInformation.sHwSettings.ulSsiPort);
	
	// Enable DMA mode for both RX and TX
	MAP_SSIDMAEnable(sSpiInformation.sHwSettings.ulSsiPort, SSI_DMA_TX);
	
	MAP_SysCtlPeripheralEnable(SYSCTL_PERIPH_UDMA);
	
	// Enable the uDMA controller.
	MAP_uDMAEnable();
	
	//Configure the DMA channels for the selected SPI Module
	MAP_uDMAChannelAssign( sSpiInformation.sHwSettings.uluDmaRxChannel);
	MAP_uDMAChannelAssign( sSpiInformation.sHwSettings.uluDmaTxChannel); 
	
	// Point at the control table to use for channel control structures
	MAP_uDMAControlBaseSet(ucDMAChannelControlStructure);	
	
	// Put the attributes in a known state for the uDMA SSI0RX channel.  These
	// should already be disabled by default.
	MAP_uDMAChannelAttributeDisable(sSpiInformation.sHwSettings.uluDmaRxChannel,
																	UDMA_ATTR_ALTSELECT | UDMA_ATTR_USEBURST |
                                    UDMA_ATTR_HIGH_PRIORITY |
																			UDMA_ATTR_REQMASK);
	
	// Configure the control parameters for the primary control structure for
	// the SSI0 RX channel. The transfer data size is 8 bits, the source
	// address does not increment since it will be reading from a register.
	// The destination address increment is byte 8-bit bytes. The arbitration
	// size is set to 1 to match the RX FIFO trigger threshold. The uDMA
	// controller will use a 4 byte burst transfer if possible.
	MAP_uDMAChannelControlSet(sSpiInformation.sHwSettings.uluDmaRxChannel | UDMA_PRI_SELECT,
														UDMA_SIZE_8 | UDMA_SRC_INC_NONE |
                              UDMA_DST_INC_8 | UDMA_ARB_1);
  
	// Put the attributes in a known state for the uDMA SSI0TX channel.  These
	// should already be disabled by default.
	MAP_uDMAChannelAttributeDisable(sSpiInformation.sHwSettings.uluDmaTxChannel,
																	UDMA_ATTR_ALTSELECT | UDMA_ATTR_USEBURST |
                                    UDMA_ATTR_HIGH_PRIORITY |
																			UDMA_ATTR_REQMASK);
	
	// Configure the control parameters for the SSI0 TX.  The uDMA SSI0 TX
	// channel is used to transfer a block of data from a buffer to the SSI.
	// The data size is 8 bits.  The source address increment is 8-bit bytes
	// since the data is coming from a buffer.  The destination increment is
	// none since the data is to be written to the SSI0 data register.  The
	// arbitration size is set to 8, which matches the SSI TX FIFO trigger
	// threshold.
	MAP_uDMAChannelControlSet(sSpiInformation.sHwSettings.uluDmaTxChannel | UDMA_PRI_SELECT,
														UDMA_SIZE_8 | UDMA_SRC_INC_8 |
                              UDMA_DST_INC_NONE | UDMA_ARB_4);
	
	// Now both the uDMA SSI TX and RX channels are primed to start a
	// transfer.  As soon as the channels are enabled, the peripheral will
	// issue a transfer request and the data transfers will begin.
	//
	// The uDMA TX/RX channel must be disabled.
	MAP_uDMAChannelDisable(sSpiInformation.sHwSettings.uluDmaRxChannel);
	MAP_uDMAChannelDisable(sSpiInformation.sHwSettings.uluDmaTxChannel);
	
	// Set the USEBURST attribute for the uDMA UART TX channel.  This will
	// force the controller to always use a burst when transferring data from
	// the TX buffer to the UART.  This is somewhat more efficient bus usage
	// than the default which allows single or burst transfers.
	//
	//uDMAChannelAttributeEnable(sSpiInformation.sHwSettings.uluDmaTxChannel, UDMA_ATTR_USEBURST);
	
	// Enable the SSI interrupt 
	MAP_IntEnable(sSpiInformation.sHwSettings.ulSsiPortInt);
}


//*****************************************************************************
//
//!  SpiClose
//!
//!  @param  none
//!
//!  @return none
//!
//!  @brief  Close the SPI interface
//
//*****************************************************************************
void
SpiClose(void)
{
	if (sSpiInformation.pRxPacket)
	{
		sSpiInformation.pRxPacket = 0;
	}
	
	//	Disable Interrupt in GPIOA module...
	tSLInformation.WlanInterruptDisable();
	
	// Disable interrupt for SPI IRQ and SSI module
	MAP_IntDisable(sSpiInformation.sHwSettings.ulPortInt);
	MAP_IntDisable(sSpiInformation.sHwSettings.ulSsiPortInt);
}


//*****************************************************************************
//
//!  SpiOpen
//!
//!  @param  none
//!
//!  @return none
//!
//!  @brief  Open the SPI interface
//
//*****************************************************************************
void 
SpiOpen(gcSpiHandleRx pfRxHandler)
{
	sSpiInformation.ulSpiState = eSPI_STATE_POWERUP;
	
	sSpiInformation.SPIRxHandler = pfRxHandler;
	sSpiInformation.usTxPacketLength = 0;
	sSpiInformation.pTxPacket = NULL;
	sSpiInformation.pRxPacket = wlan_rx_buffer;
	sSpiInformation.usRxPacketLength = 0;
	wlan_rx_buffer[CC3000_RX_BUFFER_SIZE - 1] = CC3000_BUFFER_MAGIC_NUMBER;
	wlan_tx_buffer[CC3000_TX_BUFFER_SIZE - 1] = CC3000_BUFFER_MAGIC_NUMBER;
	
	// Enable interrupt on the GPIOA ping of WLAN IRQ
	tSLInformation.WlanInterruptEnable();
	
	// Enable interrupts in NVIC
	MAP_IntEnable(sSpiInformation.sHwSettings.ulPortInt);
	MAP_IntEnable(sSpiInformation.sHwSettings.ulSsiPortInt);
}

//*****************************************************************************
//
//!  init_spi
//!
//!  @param  buffer
//!
//!  @return none
//!
//!  @brief  initializes an SPI interface
//
//*****************************************************************************

int init_spi(void)
{
	// Update the configuration in the SPI driver
	SpiConfigureHwMapping();
	
	// Configure SPI with CC3000 
	SSIConfigure(1000000, 1, 50000000);
	return(ESUCCESS);
}

//*****************************************************************************
//
//! SpiCheckDMAStatus
//!
//! @param  ch
//!
//! @return none
//!
//! @brief  This function get the current state of the SSI DMA channels
//
//*****************************************************************************
unsigned long
SpiCheckDMAStatus(long ch)
{
    long chanel;

    // 
    // Check the DMA control table to see if the basic transfer is
    // complete.  The basic transfer uses receive buffer g_ucInBuffer,
    // and the primary control structure.
    // 
    chanel = (ch == sSpiInformation.sHwSettings.uluDmaTxChannel) ? (sSpiInformation.sHwSettings.uluDmaTxChannel|UDMA_PRI_SELECT)
                                        : (sSpiInformation.sHwSettings.uluDmaRxChannel|UDMA_PRI_SELECT);
  
    return(MAP_uDMAChannelModeGet(chanel));
}

//*****************************************************************************
//
//!  SpiIsDmaStop
//!
//!  @param  ch
//!
//!  @return 1 if DMA is stopped, 0 otherwise
//!
//!  @brief  Check DMA status
//
//*****************************************************************************
long
SpiIsDmaStop(long ch)
{
	long mode;
	long enable;
	
	mode = SpiCheckDMAStatus(ch);
	enable = MAP_uDMAChannelIsEnabled(ch);
	
	if((mode == UDMA_MODE_STOP) && (!enable))
	{
		return(1);
	}
	
	return(0);
}

//*****************************************************************************
//
//! SpiFlushRxFifo
//!
//!  \param  none
//!
//!  \return none
//!
//!  \brief  flush RX 
//
//*****************************************************************************
void
SpiFlushRxFifo(void)
{
	unsigned long ulIdx;
	while(MAP_SSIDataGetNonBlocking(sSpiInformation.sHwSettings.ulSsiPort, &ulIdx))	
    //Clear the RX overrun flag
		SSIIntClear(sSpiInformation.sHwSettings.ulSsiPort, SSI_RIS_RORRIS);
}

//*****************************************************************************
//
//!  SpiFirstWrite
//!
//!  @param  ucBuf buffer to write
//!  @param  ucBuf buffer's length
//!
//!  @return none
//!
//!  @brief  Spi first write operation
//
//*****************************************************************************
long
SpiFirstWrite(unsigned char *ucBuf, unsigned short usLength)
{
	// workaround for first transaction
	ASSERT_CS();
	
	SpiSysDelay(FWT_DELAY/4);
	
