pepe2k/CC3000-SDK/CC3000 SDK/LM4F232H5QD/Basic WiFi Application/Basic WiFi Source/Source/CC3000 Spi/spi.c
	// SPI writes first 4 bytes of data
	SpiWriteDataSynchronous(ucBuf, 4);
	while(SSIBusy(SPI_BASE)); 
	SpiSysDelay(FWT_DELAY/4);
	
	SpiWriteDataSynchronous(ucBuf + 4, usLength - 4);
	
	// From this point on - operate in a regular way
	sSpiInformation.ulSpiState = eSPI_STATE_IDLE;
	while(SSIBusy(SPI_BASE));  
	DEASSERT_CS();
	
	return(0);
}



//*****************************************************************************
//
//! SpiWrite
//!
//!  @param  pUserBuffer buffer to write
//!  @param  pUserBuffer buffer's length
//!
//!  @return none
//!
//!  @brief  Spi write operation
//
//*****************************************************************************
long
SpiWrite(unsigned char *pUserBuffer, unsigned short usLength)
{
	unsigned char ucPad = 0;
	
	// Figure out the total length of the packet in order to figure out if there is padding or not
	if(!(usLength & 0x0001))
	{
		ucPad++;
	}
	
	pUserBuffer[0] = WRITE;
	pUserBuffer[1] = HI(usLength + ucPad);
	pUserBuffer[2] = LO(usLength + ucPad);
	pUserBuffer[3] = 0;
	pUserBuffer[4] = 0;
	
	usLength += (SPI_HEADER_SIZE + ucPad);
	
	// The magic number that resides at the end of the TX/RX buffer (1 byte after the allocated size)
	// for the purpose of detection of the overrun. If the magic number is overwritten - buffer overrun
	// occurred - and we will stuck here forever!
	if (wlan_tx_buffer[CC3000_TX_BUFFER_SIZE - 1] != CC3000_BUFFER_MAGIC_NUMBER)
	{
		while (1)
			;
	}
	
	if (sSpiInformation.ulSpiState == eSPI_STATE_POWERUP)
	{
		while (sSpiInformation.ulSpiState != eSPI_STATE_INITIALIZED);
	}
	
	if (sSpiInformation.ulSpiState == eSPI_STATE_INITIALIZED)
	{
		
		// This is time for first TX/RX transactions over SPI: the IRQ is down - so need to send read buffer size command
		SpiFirstWrite(pUserBuffer, usLength);
		
		// Due to the fact that we are currently implementing a blocking situation
		// here we will wait till end of transaction
	}
	else 
	{
		
		// We need to prevent here race that can occur in case 2 back to back packets are sent to the 
		// device, so the state will move to IDLE and once again to not IDLE due to IRQ
		
		while (sSpiInformation.ulSpiState != eSPI_STATE_IDLE)
		{
			;
		}
		
		sSpiInformation.ulSpiState = eSPI_STATE_WRITE_IRQ;
		sSpiInformation.pTxPacket = pUserBuffer;
		sSpiInformation.usTxPacketLength = usLength;
		
		// Assert the CS line and wait till SSI IRQ line is active and then initialize write operation     
		ASSERT_CS();      
	}
	
	// Due to the fact that we are currently implementing a blocking situation
	// here we will wait till end of transaction
	while (eSPI_STATE_IDLE != sSpiInformation.ulSpiState)
	{
		;
	}
	return(0);
}


//*****************************************************************************
//
//! SpiDisableSSIDMAChannels
//!
//!  @param  none
//!
//!  @return none
//!
//!  @brief  This function disables the SSI DMA RX/TX Channels
//
//*****************************************************************************

void
SpiDisableSSIDMAChannels()
{
    MAP_uDMAChannelDisable(sSpiInformation.sHwSettings.uluDmaTxChannel);
    MAP_uDMAChannelDisable(sSpiInformation.sHwSettings.uluDmaRxChannel);
}

//*****************************************************************************
//
//! SpiEnableSSIDMAChannels
//!
//!  @param  none
//!
//!  @return none
//!
//!  @brief  This function enables the SSI DMA Channels
//
//*****************************************************************************

void
SpiEnableSSIDMAChannels()
{
    MAP_uDMAChannelEnable(sSpiInformation.sHwSettings.uluDmaTxChannel);
    MAP_uDMAChannelEnable(sSpiInformation.sHwSettings.uluDmaRxChannel);
}

//*****************************************************************************
//
//! This function enter point for write flow
//!
//!  @param  data  buffer to read to
//!  @param  size  buffer's size
//!
//!  @return none
//!
//!  @brief  Spi read operation
//
//*****************************************************************************
void
SpiReadData(unsigned char *data, unsigned short size)
{
	
	// The uDMA TX/RX channel must be disabled.
	SpiDisableSSIDMAChannels();
	
	// Start another DMA transfer to SSI0 TX.
	MAP_uDMAChannelTransferSet((sSpiInformation.sHwSettings.uluDmaTxChannel|UDMA_PRI_SELECT),
														 UDMA_MODE_BASIC,
														 (void *)&tSpiReadHeader,
														 (void *)(sSpiInformation.sHwSettings.ulSsiPort + SSI_O_DR),
														 size );
	
	// Start another DMA transfer to SSI0 RX.
	MAP_uDMAChannelTransferSet(sSpiInformation.sHwSettings.uluDmaRxChannel|UDMA_PRI_SELECT,
														 UDMA_MODE_BASIC,
														 (void *)(sSpiInformation.sHwSettings.ulSsiPort + SSI_O_DR),
														 (void *)data,
														 size);  
	
	SpiFlushRxFifo();
	MAP_SSIDMAEnable(sSpiInformation.sHwSettings.ulSsiPort, SSI_DMA_TX | SSI_DMA_RX);
	
	// The uDMA RX channel must be re-enabled.
	// The uDMA TX channel is not required - then it will not be enabled at all 
	// (for second part of RX it is required, since the host issues write command)
	MAP_uDMAChannelEnable(sSpiInformation.sHwSettings.uluDmaTxChannel);
	MAP_uDMAChannelEnable(sSpiInformation.sHwSettings.uluDmaRxChannel);
	
}
//*****************************************************************************
//
//! SpiWriteAsync
//!
//!  @param  data  buffer to write
//!  @param  size  buffer's size
//!
//!  @return none
//!
//!  @brief  Spi write operation
//
//*****************************************************************************
void
SpiWriteAsync(const unsigned char *data, unsigned short size)
{
	
	// LMS uDMA is capable to transfer data in one shot only of size up to 1024
	// so in case of bigger transfer size will need to perform 2 transfers 
	// (scatter-gather uDMA  mode also can be used but it will not be very useful 
	// since CPU anyway is blocked on SPI write operation and can not do anything 
	// till the end.
	if (size<=SPI_WINDOW_SIZE)
	{
	
       sSpiInformation.ulSpiState = eSPI_STATE_WRITE_EOT;

    	// The uDMA TX/RX channel must be disabled.
   		SpiDisableSSIDMAChannels();

   		// Start another DMA transfer to SSI0 TX.	
		MAP_uDMAChannelTransferSet((sSpiInformation.sHwSettings.uluDmaTxChannel|UDMA_PRI_SELECT),UDMA_MODE_BASIC,(void *)data,
		(void *)(sSpiInformation.sHwSettings.ulSsiPort + SSI_O_DR), size );
		// Flush out buffer
		SpiFlushRxFifo();
		
