pepe2k/CC3000-SDK/CC3000 SDK/LM4F232H5QD/Basic WiFi Application/Basic WiFi Source/Source/CC3000 Spi/spi.c
		MAP_SSIDMAEnable(sSpiInformation.sHwSettings.ulSsiPort, SSI_DMA_TX );
		
		// Send the Data 
		MAP_uDMAChannelEnable(sSpiInformation.sHwSettings.uluDmaTxChannel);
	}
	
	else
	{
		
		// Send the data over SPI and wait for complete interrupt to transfer the rest
		sSpiInformation.ulSpiState = eSPI_STATE_WRITE_FIRST_PORTION;
	  

        // The uDMA TX/RX channel must be disabled.
        SpiDisableSSIDMAChannels();

        // Start another DMA transfer to SSI0 TX. 
        MAP_uDMAChannelTransferSet(sSpiInformation.sHwSettings.uluDmaTxChannel|UDMA_PRI_SELECT, UDMA_MODE_BASIC, (void *)data,
                               (void *)(sSpiInformation.sHwSettings.ulSsiPort + SSI_O_DR),SPI_WINDOW_SIZE);  
      //
      // The uDMA TX channel must be re-enabled.
      MAP_uDMAChannelEnable(sSpiInformation.sHwSettings.uluDmaTxChannel);
      MAP_uDMAChannelEnable(sSpiInformation.sHwSettings.uluDmaRxChannel);
	}
	
}

//*****************************************************************************
//
//! SpiNewWriteAsync
//!
//!  @param  data  buffer to write
//!  @param  size  buffer's size
//!
//!  @return none
//!
//!  @brief  
//
//*****************************************************************************
void
SpiNewWriteAsync(unsigned char *data, unsigned short size)
{
	
}
//*****************************************************************************
//
//! SpiWriteDataSynchronous
//!
//!  @param  data  buffer to write
//!  @param  size  buffer's size
//!
//!  @return none
//!
//!  @brief  Spi write operation
//
//*****************************************************************************
void
SpiWriteDataSynchronous(const unsigned char *data, unsigned short size)
{
	// we are in the SYNC write to SPI - we do not want to receive ANY SSI related
	// interrupts
	MAP_IntDisable(sSpiInformation.sHwSettings.ulSsiPortInt);
	SpiWriteAsync(data, size);
	
	// The last one to finish operation is RX channel since
	// TX is finished before the last bit is on the bus XXX was RX
	while(SSIBusy(SPI_BASE));
	
	// Clear The SSI & DMA Interrupt and enable back SSI
	IntPendClear(INT_SPI);
	IntPendClear(INT_UDMA);
	
	// Enable back SSIO ISR
	MAP_IntEnable(sSpiInformation.sHwSettings.ulSsiPortInt);
}


//*****************************************************************************
//
//! SpiReadHeader
//!
//!  @param  none
//!
//!  @return none
//!
//!  @brief  SPI read operation. first we read minimal 5 SPI header bytes and 5 
//!	         Event Data bytes
//
//*****************************************************************************
void
SpiReadHeader(void)
{
	sSpiInformation.ulSpiState = eSPI_STATE_READ_IRQ;
	
	SpiReadData(sSpiInformation.pRxPacket, 10);
}


//*****************************************************************************
//
//! SpiReadDataCont
//!
//!  \param  None
//!
//!  \return None
//!
//!  \brief  This function processes received SPI Header and in accordance with 
//!          it - continues reading the packet
//
//*****************************************************************************
long
SpiReadDataCont(void)
{
	
	long data_to_recv;
	unsigned char *evnt_buff, type;
	
	//determine what type of packet we have
	evnt_buff =  sSpiInformation.pRxPacket;
	data_to_recv = 0;
	STREAM_TO_UINT8((char *)(evnt_buff + SPI_HEADER_SIZE), HCI_PACKET_TYPE_OFFSET, type);
	
	switch(type)
	{
	case HCI_TYPE_DATA:
		{
			STREAM_TO_UINT16((char *)(evnt_buff + SPI_HEADER_SIZE), HCI_DATA_LENGTH_OFFSET, data_to_recv);
			
			if (data_to_recv >= SPI_WINDOW_SIZE)
			{
				data_to_recv = eSPI_STATE_READ_FIRST_PORTION;
				SpiReadData(evnt_buff + 10, SPI_WINDOW_SIZE);
				sSpiInformation.ulSpiState = eSPI_STATE_READ_FIRST_PORTION;
			}
			else
			{
				// We need to read the rest of data..
				if (!((HEADERS_SIZE_EVNT + data_to_recv) & 1))
				{	
					data_to_recv++;
				}
				
				if (data_to_recv)
				{
					SpiReadData(evnt_buff + 10, data_to_recv);
				}
				
				sSpiInformation.ulSpiState = eSPI_STATE_READ_EOT;
			}
			break;
		}
	case HCI_TYPE_EVNT:
		{
			
			// Calculate the rest length of the data
			STREAM_TO_UINT8((char *)(evnt_buff + SPI_HEADER_SIZE), HCI_EVENT_LENGTH_OFFSET, data_to_recv);
			data_to_recv -= 1;
			
			// Add padding byte if needed
			if ((HEADERS_SIZE_EVNT + data_to_recv) & 1)
			{
				
				data_to_recv++;
			}
			
			if (data_to_recv)
			{
				SpiReadData(evnt_buff + 10, data_to_recv);
			}
			
			sSpiInformation.ulSpiState = eSPI_STATE_READ_EOT;
			break;
		}
	}
	
	return (data_to_recv);
}


//*****************************************************************************
//
//! SpiDisableInterrupts
//!
//!  @param  none
//!
//!  @return none
//!
//!  @brief  Disable SPI interrupts
//
//*****************************************************************************

void 
SpiDisableInterrupts(void)
{
	MAP_IntDisable(sSpiInformation.sHwSettings.ulSsiPortInt);
	MAP_IntDisable(sSpiInformation.sHwSettings.ulPortInt);
}


//*****************************************************************************
//
//! SpiResumeSpi
//!
//!  @param  none
//!
//!  @return none
//!
//!  @brief  Spi resume operation
//
//*****************************************************************************

void 
SpiResumeSpi(void)
{
	MAP_IntEnable(sSpiInformation.sHwSettings.ulSsiPortInt);
	MAP_IntEnable(sSpiInformation.sHwSettings.ulPortInt);
}


//*****************************************************************************
//
//! SpiTriggerRxProcessing
//!
//!  @param  none
//!
//!  @return none
//!
//!  @brief  Processing operation for SPI RX
//
//*****************************************************************************
void 
SpiTriggerRxProcessing(void)
{
	
	// Trigger Rx processing
	SpiDisableInterrupts();
	while(SSIBusy(SPI_BASE));     
	DEASSERT_CS();
	
	// The magic number that resides at the end of the TX/RX buffer (1 byte after the allocated size)
	// for the purpose of detection of the overrun. If the magic number is overwritten - buffer overrun
	// occurred - and we will stuck here forever!
	if (sSpiInformation.pRxPacket[CC3000_RX_BUFFER_SIZE - 1] != CC3000_BUFFER_MAGIC_NUMBER)
	{
		while (1)
			;
	}
	
	MAP_SSIDMADisable(sSpiInformation.sHwSettings.ulSsiPort, SSI_DMA_RX);
	sSpiInformation.ulSpiState = eSPI_STATE_IDLE;
	sSpiInformation.SPIRxHandler(sSpiInformation.pRxPacket + SPI_HEADER_SIZE);
}

//*****************************************************************************
//
//! SSIContReadOperationw
//!
//!  @param  none
//!
//!  @return none
//!
//!  @brief  Spi read operation
//
//*****************************************************************************

void
SSIContReadOperation(void)
{
	
	// The header was read - continue with  the payload read
	if (!SpiReadDataCont())
	{		
		// All the data was read - finalize handling by switching to the task
		//	and calling from task Event Handler
		SpiTriggerRxProcessing();
	}
}

//*****************************************************************************
// 
//!  IntSpiGPIOHandler
//! 
//!  @param  none
//! 
//!  @return none
//! 
//!  @brief  GPIO A interrupt handler. When the external SSI WLAN device is
//!          ready to interact with Host CPU it generates an interrupt signal.
//!          After that Host CPU has registered this interrupt request
//!          it set the corresponding /CS in active state.
// 
//*****************************************************************************
void
IntSpiGPIOHandler(void)
{
	SpiCleanGPIOISR();
	if(!MAP_GPIOPinRead(SPI_GPIO_IRQ_BASE, SPI_IRQ_PIN))
	{
		if (sSpiInformation.ulSpiState == eSPI_STATE_POWERUP)
		{
			// This means IRQ line was low call a callback of HCI Layer to 
			// inform on event
			sSpiInformation.ulSpiState = eSPI_STATE_INITIALIZED;
		}
		else if (sSpiInformation.ulSpiState == eSPI_STATE_IDLE)
		{
			sSpiInformation.ulSpiState = eSPI_STATE_READ_IRQ;
			
			// IRQ line goes down - we are start reception 
			ASSERT_CS();    
			
			// Wait for TX/RX Compete which will come as DMA interrupt
			SpiReadHeader();
		}
		else if (sSpiInformation.ulSpiState == eSPI_STATE_WRITE_IRQ)
		{
			SpiWriteAsync(sSpiInformation.pTxPacket, sSpiInformation.usTxPacketLength);    
		}
	}
}


//*****************************************************************************
//
//! SpiIntHandler
//!
//! @param  none
//!
//! @return none
//!
//! @brief  SSI interrupt handler. Get command/data packet from the external
//!         WLAN device and pass it through the UART to the PC
//
//*****************************************************************************
void
SpiIntHandler(void)
{	
	unsigned long ucTxFinished, ucRxFinished;
	unsigned short data_to_recv;
	unsigned char *evnt_buff;
	ucTxFinished = SpiIsDmaStop(sSpiInformation.sHwSettings.uluDmaTxChannel) ;
	ucRxFinished = SpiIsDmaStop(sSpiInformation.sHwSettings.uluDmaRxChannel) ;
	evnt_buff =  sSpiInformation.pRxPacket;
	data_to_recv = 0;
	if (sSpiInformation.ulSpiState == eSPI_STATE_READ_IRQ)
	{
		
		// If one of DMA's still did not finished its operation - we need to stay
		// and wait till it will finish
		if (ucTxFinished && ucRxFinished)
		{
			
			// If SSI Int is pending - this can be second DMA - clean it...
			IntPendClear(sSpiInformation.sHwSettings.ulSsiPortInt);
			SSIContReadOperation();
		}
	}
	else if (sSpiInformation.ulSpiState == eSPI_STATE_READ_FIRST_PORTION)
	{
		if (ucRxFinished)
		{
			// If SSI Int is pending - this can be second DMA - clean it...
			IntPendClear(sSpiInformation.sHwSettings.ulSsiPortInt);
			
			
			STREAM_TO_UINT16((char *)(evnt_buff + SPI_HEADER_SIZE), HCI_DATA_LENGTH_OFFSET, data_to_recv);
			
			// We need to read the rest of data..
			
