pepe2k/CC3000-SDK/CC3000 SDK/LM4F232H5QD/Basic WiFi Application/Basic WiFi Source/Source/CC3000 Spi/spi.c
			data_to_recv -=SPI_WINDOW_SIZE;
			
			
			if (!((HEADERS_SIZE_EVNT + data_to_recv) & 1))
			{	
				data_to_recv++;
			}
			
			SpiReadData(sSpiInformation.pRxPacket + 10 + SPI_WINDOW_SIZE, data_to_recv);
			
			sSpiInformation.ulSpiState = eSPI_STATE_READ_EOT;
		}
	}
	else if (sSpiInformation.ulSpiState == eSPI_STATE_READ_EOT)
	{
		// All the data was read - finalize handling by switching to the task
		// and calling from task Event Handler
		if (ucRxFinished)
		{
			
			// If SSI Int is pending - this can be second DMA - clean it...
			IntPendClear(sSpiInformation.sHwSettings.ulSsiPortInt);
			
			SpiTriggerRxProcessing();
		}
	}
	else if (sSpiInformation.ulSpiState == eSPI_STATE_WRITE_EOT)
	{
		if (ucTxFinished)
		{
			while(SSIBusy(SPI_BASE));
			DEASSERT_CS();
			// Since SSI is full duplex and RX data is irrelevant - flush it		
			SpiFlushRxFifo();
			sSpiInformation.ulSpiState = eSPI_STATE_IDLE;
		}
	}
	else if (sSpiInformation.ulSpiState == eSPI_STATE_WRITE_FIRST_PORTION)
	{
		if (ucTxFinished)
		{
			// Since SSI is full duplex and RX data is irrelevant - flush it	
			SpiFlushRxFifo();
			
			sSpiInformation.ulSpiState = eSPI_STATE_WRITE_EOT;
			
			SpiWriteAsync(sSpiInformation.pTxPacket + SPI_WINDOW_SIZE, sSpiInformation.usTxPacketLength - SPI_WINDOW_SIZE);
		}
	}
}



//*****************************************************************************
//
// Close the Doxygen group.
//! @}
//
//*****************************************************************************
